In [1]:
import pandas as pd

In [7]:
df=pd.read_csv("ex1.csv", header=None, names=["z","x","w","v","u"])

In [8]:
df

   z   x   w   v        u
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [9]:
df.head(2)

   z  x  w  v        u
0  a  b  c  d  message
1  1  2  3  4    hello

In [10]:
df.tail(2)

   z   x   w   v      u
2  5   6   7   8  world
3  9  10  11  12    foo

In [11]:
df["x"]

0     b
1     2
2     6
3    10
Name: x, dtype: object

In [16]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df2=pd.read_csv("test.tsv", sep="\t")
df2

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [19]:
df3=pd.read_table("test.tsv")
df3

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar